Repository: HotCakeX/Harden-Windows-Security
Catalog: Harden System Security/Strings/*/Resources.resw
Source language: en_us
Languages: ar, de_de, el_gr, es, fr_fr, he_il, hi_in, ml_in, pl_pl

# CheckForUpdateSettingsCard.Description
source: Once the updates are downloaded and installed, the next time you open the Harden System Security you will use the new version.
ar: بمجرد تنزيل التحديثات وتثبيتها، في المرة القادمة التي تفتح فيها Harden System Security ستستخدم النسخة الجديدة.
de_de: Sobald die Updates heruntergeladen und installiert wurden, verwenden Sie beim nächsten Start von Harden System Security die neue Version.
el_gr: Μόλις ληφθούν και εγκατασταθούν οι ενημερώσεις, την επόμενη φορά που θα ανοίξετε το Harden System Security θα χρησιμοποιήσετε τη νέα έκδοση.
es: Una vez que las actualizaciones se descarguen e instalen, la próxima vez que abra Harden System Security usará la nueva versión.
fr_fr: Une fois les mises à jour téléchargées et installées, la prochaine fois que vous ouvrirez Harden System Security, vous utiliserez la nouvelle version.
he_il: לאחר שהעדכונים יורדו ויותקנו, בפעם הבאה שתפתח את Harden System Security תשתמש בגרסה החדשה.
hi_in: एक बार अपडेट डाउनलोड और इंस्टॉल हो जाने के बाद, अगली बार जब आप Harden System Security खोलेंगे तो आप नए संस्करण का उपयोग करेंगे।
ml_in: അപ്ഡേറ്റുകൾ ഡൗൺലോഡും ഇൻസ്റ്റാളും ചെയ്തുകഴിഞ്ഞാൽ, അടുത്ത തവണ നിങ്ങൾ Harden System Security തുറക്കുമ്പോൾ നിങ്ങൾ പുതിയ പതിപ്പ് ഉപയോഗിക്കും.
pl_pl: Po pobraniu i zainstalowaniu aktualizacji będziesz używać nowej wersji następnym razem, gdy otworzysz Harden System Security.

# CheckForUpdateSettingsCard.Header
source: Check for Harden System Security update
ar: البحث عن تحديث Harden System Security
de_de: Nach Update für Harden System Security suchen
el_gr: Έλεγχος για ενημέρωση Harden System Security
es: Buscar actualización de Harden System Security
fr_fr: Rechercher une mise à jour de Harden System Security
he_il: בדיקת עדכון ל-Harden System Security
hi_in: Harden System Security अपडेट की जांच करें
ml_in: Harden System Security അപ്ഡേറ്റിനായി പരിശോധിക്കുക
pl_pl: Sprawdź aktualizację Harden System Security

# CheckForUpdateSettingsCard.ToolTipService.ToolTip
source: Once the updates are downloaded and installed, the next time you open the Harden System Security you will use the new version.
ar: بمجرد تنزيل التحديثات وتثبيتها، في المرة القادمة التي تفتح فيها Harden System Security ستستخدم النسخة الجديدة.
de_de: Sobald die Updates heruntergeladen und installiert wurden, verwenden Sie beim nächsten Start von Harden System Security die neue Version.
el_gr: Μόλις ληφθούν και εγκατασταθούν οι ενημερώσεις, την επόμενη φορά που θα ανοίξετε το Harden System Security θα χρησιμοποιήσετε τη νέα έκδοση.
es: Una vez que las actualizaciones se descarguen e instalen, la próxima vez que abra Harden System Security usará la nueva versión.
fr_fr: Une fois les mises à jour téléchargées et installées, la prochaine fois que vous ouvrirez Harden System Security, vous utiliserez la nouvelle version.
he_il: לאחר שהעדכונים יורדו ויותקנו, בפעם הבאה שתפתח את Harden System Security תשתמש בגרסה החדשה.
hi_in: एक बार अपडेट डाउनलोड और इंस्टॉल हो जाने के बाद, अगली बार जब आप Harden System Security खोलेंगे तो आप नए संस्करण का उपयोग करेंगे।
ml_in: അപ്ഡേറ്റുകൾ ഡൗൺലോഡും ഇൻസ്റ്റാളും ചെയ്തുകഴിഞ്ഞാൽ, അടുത്ത തവണ നിങ്ങൾ Harden System Security തുറക്കുമ്പോൾ നിങ്ങൾ പുതിയ പതിപ്പ് ഉപയോഗിക്കും.
pl_pl: Po pobraniu i zainstalowaniu aktualizacji będziesz używać nowej wersji następnym razem, gdy otworzysz Harden System Security.

# CheckForUpdateSettingsCard.AutomationProperties.HelpText
source: Once the updates are downloaded and installed, the next time you open the Harden System Security you will use the new version.
ar: بمجرد تنزيل التحديثات وتثبيتها، في المرة القادمة التي تفتح فيها Harden System Security ستستخدم النسخة الجديدة.
de_de: Sobald die Updates heruntergeladen und installiert wurden, verwenden Sie beim nächsten Start von Harden System Security die neue Version.
el_gr: Μόλις ληφθούν και εγκατασταθούν οι ενημερώσεις, την επόμενη φορά που θα ανοίξετε το Harden System Security θα χρησιμοποιήσετε τη νέα έκδοση.
es: Una vez que las actualizaciones se descarguen e instalen, la próxima vez que abra Harden System Security usará la nueva versión.
fr_fr: Une fois les mises à jour téléchargées et installées, la prochaine fois que vous ouvrirez Harden System Security, vous utiliserez la nouvelle version.
he_il: לאחר שהעדכונים יורדו ויותקנו, בפעם הבאה שתפתח את Harden System Security תשתמש בגרסה החדשה.
hi_in: एक बार अपडेट डाउनलोड और इंस्टॉल हो जाने के बाद, अगली बार जब आप Harden System Security खोलेंगे तो आप नए संस्करण का उपयोग करेंगे।
ml_in: അപ്ഡേറ്റുകൾ ഡൗൺലോഡും ഇൻസ്റ്റാളും ചെയ്തുകഴിഞ്ഞാൽ, അടുത്ത തവണ നിങ്ങൾ Harden System Security തുറക്കുമ്പോൾ നിങ്ങൾ പുതിയ പതിപ്പ് ഉപയോഗിക്കും.
pl_pl: Po pobraniu i zainstalowaniu aktualizacji będziesz używać nowej wersji następnym razem, gdy otworzysz Harden System Security.

# UpdatePageCheckForUpdateButton.ToolTipService.ToolTip
source: Will download and install the latest version from the GitHub repository. The time it takes depends on your network connection. Approximate download size is 65 MB.
ar: سيقوم بتنزيل وتثبيت أحدث نسخة من مستودع GitHub. الوقت المستغرق يعتمد على اتصال الشبكة لديك. حجم التنزيل التقريبي هو 65 ميجابايت.
de_de: Lädt die neueste Version aus dem GitHub-Repository herunter und installiert sie. Die Dauer hängt von Ihrer Netzwerkverbindung ab. Ungefähre Downloadgröße: 65 MB.
el_gr: Θα κατεβάσει και θα εγκαταστήσει την πιο πρόσφατη έκδοση από το αποθετήριο GitHub. Ο χρόνος που χρειάζεται εξαρτάται από τη σύνδεση δικτύου σας. Το κατά προσέγγιση μέγεθος λήψης είναι 65 MB.
es: Descargará e instalará la versión más reciente del repositorio de GitHub. El tiempo requerido depende de su conexión de red. El tamaño aproximado de descarga es 65 MB.
fr_fr: Téléchargera et installera la dernière version depuis le dépôt GitHub. Le temps nécessaire dépend de votre connexion réseau. La taille du téléchargement est d'environ 65 Mo.
he_il: יוריד ויתקין את הגרסה האחרונה ממאגר GitHub. משך הפעולה תלוי בחיבור הרשת שלך. גודל ההורדה המשוער הוא 65 MB.
hi_in: GitHub रिपॉजिटरी से नवीनतम संस्करण डाउनलोड और इंस्टॉल करेगा। आवश्यक समय आपके नेटवर्क कनेक्शन पर निर्भर करता है। अनुमानित डाउनलोड आकार 65 MB है।
ml_in: GitHub റിപ്പോസിറ്ററിയിൽ നിന്ന് ഏറ്റവും പുതിയ പതിപ്പ് ഡൗൺലോഡും ഇൻസ്റ്റാളും ചെയ്യും. ആവശ്യമായ സമയം നിങ്ങളുടെ നെറ്റ്‌വർക്ക് കണക്ഷനെ ആശ്രയിച്ചിരിക്കുന്നു. ഏകദേശ ഡൗൺലോഡ് വലുപ്പം 65 MB ആണ്.
pl_pl: Pobierze i zainstaluje najnowszą wersję z repozytorium GitHub. Wymagany czas zależy od połączenia sieciowego. Przybliżony rozmiar pobierania to 65 MB.

# UpdatePageCheckForUpdateButton.AutomationProperties.HelpText
source: Will download and install the latest version from the GitHub repository. The time it takes depends on your network connection. Approximate download size is 65 MB.
ar: سيقوم بتنزيل وتثبيت أحدث نسخة من مستودع GitHub. الوقت المستغرق يعتمد على اتصال الشبكة لديك. حجم التنزيل التقريبي هو 65 ميجابايت.
de_de: Lädt die neueste Version aus dem GitHub-Repository herunter und installiert sie. Die Dauer hängt von Ihrer Netzwerkverbindung ab. Ungefähre Downloadgröße: 65 MB.
el_gr: Θα κατεβάσει και θα εγκαταστήσει την πιο πρόσφατη έκδοση από το αποθετήριο GitHub. Ο χρόνος που χρειάζεται εξαρτάται από τη σύνδεση δικτύου σας. Το κατά προσέγγιση μέγεθος λήψης είναι 65 MB.
es: Descargará e instalará la versión más reciente del repositorio de GitHub. El tiempo requerido depende de su conexión de red. El tamaño aproximado de descarga es 65 MB.
fr_fr: Téléchargera et installera la dernière version depuis le dépôt GitHub. Le temps nécessaire dépend de votre connexion réseau. La taille du téléchargement est d'environ 65 Mo.
he_il: יוריד ויתקין את הגרסה האחרונה ממאגר GitHub. משך הפעולה תלוי בחיבור הרשת שלך. גודל ההורדה המשוער הוא 65 MB.
hi_in: GitHub रिपॉजिटरी से नवीनतम संस्करण डाउनलोड और इंस्टॉल करेगा। आवश्यक समय आपके नेटवर्क कनेक्शन पर निर्भर करता है। अनुमानित डाउनलोड आकार 65 MB है।
ml_in: GitHub റിപ്പോസിറ്ററിയിൽ നിന്ന് ഏറ്റവും പുതിയ പതിപ്പ് ഡൗൺലോഡും ഇൻസ്റ്റാളും ചെയ്യും. ആവശ്യമായ സമയം നിങ്ങളുടെ നെറ്റ്‌വർക്ക് കണക്ഷനെ ആശ്രയിച്ചിരിക്കുന്നു. ഏകദേശ ഡൗൺലോഡ് വലുപ്പം 65 MB ആണ്.
pl_pl: Pobierze i zainstaluje najnowszą wersję z repozytorium GitHub. Wymagany czas zależy od połączenia sieciowego. Przybliżony rozmiar pobierania to 65 MB.

# AutoUpdateCheckSettingsCard.Description
source: Automatically checks for update when the app launches and notify you if a new version is available so you can use this page to install it.
ar: يفحص تلقائياً للتحديث عند تشغيل التطبيق ويخطرك إذا كانت نسخة جديدة متاحة حتى تتمكن من استخدام هذه الصفحة لتثبيتها.
de_de: Sucht beim Start der App automatisch nach Updates und benachrichtigt Sie, wenn eine neue Version verfügbar ist, damit Sie sie auf dieser Seite installieren können.
el_gr: Ελέγχει αυτόματα για ενημέρωση όταν εκκινείται η εφαρμογή και σας ειδοποιεί εάν είναι διαθέσιμη νέα έκδοση ώστε να μπορείτε να χρησιμοποιήσετε αυτή τη σελίδα για να την εγκαταστήσετε.
es: Verifica automáticamente una actualización cuando la aplicación se inicia y le notifica si una nueva versión está disponible para que pueda usar esta página para instalarla.
fr_fr: Vérifie automatiquement les mises à jour au lancement de l'application et vous avertit si une nouvelle version est disponible afin que vous puissiez utiliser cette page pour l'installer.
he_il: בודק אוטומטית עדכון בעת הפעלת האפליקציה ומודיע לך אם יש גרסה חדשה זמינה כדי שתוכל להשתמש בעמוד זה להתקנה.
hi_in: एप्लिकेशन स्टार्ट होने पर स्वचालित रूप से अपडेट की जांच करता है और यदि नया संस्करण उपलब्ध है तो आपको सूचित करता है ताकि आप इसे इंस्टॉल करने के लिए इस पेज का उपयोग कर सकें।
ml_in: ആപ്ലിക്കേഷൻ ആരംഭിക്കുമ്പോൾ സ്വയമേവ അപ്ഡേറ്റ് പരിശോധിക്കുകയും പുതിയ പതിപ്പ് ലഭ്യമാണെങ്കിൽ നിങ്ങളെ അറിയിക്കുകയും ചെയ്യുന്നു, അതിനാൽ നിങ്ങൾക്ക് അത് ഇൻസ്റ്റാൾ ചെയ്യാൻ ഈ പേജ് ഉപയോഗിക്കാം.
pl_pl: Automatycznie sprawdza aktualizacje przy uruchomieniu aplikacji i powiadamia Cię, jeśli dostępna jest nowa wersja, więc możesz użyć tej strony, aby ją zainstalować.

# AutoUpdateCheckSettingsCard.Header
source: Auto Update Check
ar: فحص التحديث التلقائي
de_de: Automatische Update-Prüfung
el_gr: Αυτόματος έλεγχος ενημερώσεων
es: Verificación automática de actualizaciones
fr_fr: Vérification automatique des mises à jour
he_il: בדיקת עדכונים אוטומטית
hi_in: स्वचालित अपडेट जांच
ml_in: ഓട്ടോമാറ്റിക് അപ്ഡേറ്റ് ചെക്കിംഗ്
pl_pl: Automatyczne sprawdzanie aktualizacji

# AutoUpdateCheckSettingsCard.ToolTipService.ToolTip
source: Automatically checks for update when the app launches and notify you if a new version is available so you can use this page to install it.
ar: يفحص تلقائياً للتحديث عند تشغيل التطبيق ويخطرك إذا كانت نسخة جديدة متاحة حتى تتمكن من استخدام هذه الصفحة لتثبيتها.
de_de: Sucht beim Start der App automatisch nach Updates und benachrichtigt Sie, wenn eine neue Version verfügbar ist, damit Sie sie auf dieser Seite installieren können.
el_gr: Ελέγχει αυτόματα για ενημέρωση όταν εκκινείται η εφαρμογή και σας ειδοποιεί εάν είναι διαθέσιμη νέα έκδοση ώστε να μπορείτε να χρησιμοποιήσετε αυτή τη σελίδα για να την εγκαταστήσετε.
es: Verifica automáticamente una actualización cuando la aplicación se inicia y le notifica si una nueva versión está disponible para que pueda usar esta página para instalarla.
fr_fr: Vérifie automatiquement les mises à jour au lancement de l'application et vous avertit si une nouvelle version est disponible afin que vous puissiez utiliser cette page pour l'installer.
he_il: בודק אוטומטית עדכון בעת הפעלת האפליקציה ומודיע לך אם יש גרסה חדשה זמינה כדי שתוכל להשתמש בעמוד זה להתקנה.
hi_in: एप्लिकेशन स्टार्ट होने पर स्वचालित रूप से अपडेट की जांच करता है और यदि नया संस्करण उपलब्ध है तो आपको सूचित करता है ताकि आप इसे इंस्टॉल करने के लिए इस पेज का उपयोग कर सकें।
ml_in: ആപ്ലിക്കേഷൻ ആരംഭിക്കുമ്പോൾ സ്വയമേവ അപ്ഡേറ്റ് പരിശോധിക്കുകയും പുതിയ പതിപ്പ് ലഭ്യമാണെങ്കിൽ നിങ്ങളെ അറിയിക്കുകയും ചെയ്യുന്നു, അതിനാൽ നിങ്ങൾക്ക് അത് ഇൻസ്റ്റാൾ ചെയ്യാൻ ഈ പേജ് ഉപയോഗിക്കാം.
pl_pl: Automatycznie sprawdza aktualizacje przy uruchomieniu aplikacji i powiadamia Cię, jeśli dostępna jest nowa wersja, więc możesz użyć tej strony, aby ją zainstalować.

# AutoUpdateCheckSettingsCard.AutomationProperties.HelpText
source: Automatically checks for update when the app launches and notify you if a new version is available so you can use this page to install it.
ar: يفحص تلقائياً للتحديث عند تشغيل التطبيق ويخطرك إذا كانت نسخة جديدة متاحة حتى تتمكن من استخدام هذه الصفحة لتثبيتها.
de_de: Sucht beim Start der App automatisch nach Updates und benachrichtigt Sie, wenn eine neue Version verfügbar ist, damit Sie sie auf dieser Seite installieren können.
el_gr: Ελέγχει αυτόματα για ενημέρωση όταν εκκινείται η εφαρμογή και σας ειδοποιεί εάν είναι διαθέσιμη νέα έκδοση ώστε να μπορείτε να χρησιμοποιήσετε αυτή τη σελίδα για να την εγκαταστήσετε.
es: Verifica automáticamente una actualización cuando la aplicación se inicia y le notifica si una nueva versión está disponible para que pueda usar esta página para instalarla.
fr_fr: Vérifie automatiquement les mises à jour au lancement de l'application et vous avertit si une nouvelle version est disponible afin que vous puissiez utiliser cette page pour l'installer.
he_il: בודק אוטומטית עדכון בעת הפעלת האפליקציה ומודיע לך אם יש גרסה חדשה זמינה כדי שתוכל להשתמש בעמוד זה להתקנה.
hi_in: एप्लिकेशन स्टार्ट होने पर स्वचालित रूप से अपडेट की जांच करता है और यदि नया संस्करण उपलब्ध है तो आपको सूचित करता है ताकि आप इसे इंस्टॉल करने के लिए इस पेज का उपयोग कर सकें।
ml_in: ആപ്ലിക്കേഷൻ ആരംഭിക്കുമ്പോൾ സ്വയമേവ അപ്ഡേറ്റ് പരിശോധിക്കുകയും പുതിയ പതിപ്പ് ലഭ്യമാണെങ്കിൽ നിങ്ങളെ അറിയിക്കുകയും ചെയ്യുന്നു, അതിനാൽ നിങ്ങൾക്ക് അത് ഇൻസ്റ്റാൾ ചെയ്യാൻ ഈ പേജ് ഉപയോഗിക്കാം.
pl_pl: Automatycznie sprawdza aktualizacje przy uruchomieniu aplikacji i powiadamia Cię, jeśli dostępna jest nowa wersja, więc możesz użyć tej strony, aby ją zainstalować.

# HardenedUpdateProcedureSettingsCard.Description
source: When this option is enabled, the temporary private key of the on-device generated certificate will be linked to the user's account, requiring confirmation of prompts before it can be used for signing.
ar: عند تمكين هذا الخيار، سيتم ربط المفتاح الخاص المؤقت للشهادة المُنشأة على الجهاز بحساب المستخدم، مما يتطلب تأكيد المطالبات قبل أن يتمكن من استخدامه للتوقيع.
de_de: Wenn diese Option aktiviert ist, wird der temporäre private Schlüssel des geräteintern erzeugten Zertifikats mit dem Benutzerkonto verknüpft; bevor er zum Signieren verwendet werden kann, ist die Bestätigung von Eingabeaufforderungen erforderlich.
el_gr: Όταν αυτή η επιλογή είναι ενεργοποιημένη, το προσωρινό ιδιωτικό κλειδί του πιστοποιητικού που δημιουργήθηκε στη συσκευή θα συνδεθεί με τον λογαριασμό του χρήστη, απαιτώντας επιβεβαίωση των προτροπών πριν μπορέσει να χρησιμοποιηθεί για υπογραφή.
es: Cuando esta opción está habilitada, la clave privada temporal del certificado generado en el dispositivo se vinculará a la cuenta de usuario, requiriendo confirmación de avisos antes de que pueda usarse para firmar.
fr_fr: Lorsque cette option est activée, la clé privée temporaire du certificat généré sur l'appareil sera liée au compte de l'utilisateur, nécessitant la confirmation des invites avant de pouvoir être utilisée pour la signature.
he_il: כאשר אפשרות זו מופעלת, המפתח הפרטי הזמני של האישור שנוצר במכשיר יקושר לחשבון המשתמש, ותידרש אישור של בקשות לפני שניתן יהיה להשתמש בו לחתימה.
hi_in: जब यह विकल्प सक्षम है, तो डिवाइस पर उत्पन्न प्रमाणपत्र की अस्थायी निजी कुंजी उपयोगकर्ता खाते से बंधी होगी, जिससे हस्ताक्षर के लिए उपयोग करने से पहले प्रॉम्प्ट की पुष्टि की आवश्यकता होगी।
ml_in: ഈ ഓപ്ഷൻ പ്രാപ്തമാക്കുമ്പോൾ, ഉപകരണത്തിൽ സൃഷ്ടിക്കപ്പെട്ട സർട്ടിഫിക്കറ്റിന്റെ താൽക്കാലിക സ്വകാര്യ കീ ഉപയോക്തൃ അക്കൗണ്ടുമായി ബന്ധിപ്പിക്കും, ഒപ്പുവയ്ക്കാൻ ഉപയോഗിക്കുന്നതിന് മുമ്പ് പ്രോംപ്റ്റുകളുടെ സ്ഥിരീകരണം ആവശ്യപ്പെടും.
pl_pl: Gdy ta opcja jest włączona, tymczasowy klucz prywatny certyfikatu utworzonego na urządzeniu będzie powiązany z kontem użytkownika, wymagając potwierdzenia monitów przed użyciem do podpisywania.

# HardenedUpdateProcedureSettingsCard.Header
source: Hardened Update Procedure
ar: إجراء التحديث المقوى
de_de: Gehärtetes Update-Verfahren
el_gr: Ενισχυμένη διαδικασία ενημέρωσης
es: Procedimiento de actualización endurecido
fr_fr: Procédure de mise à jour renforcée
he_il: הליך עדכון מוקשח
hi_in: कठोर अपडेट प्रक्रिया
ml_in: കർശനമാക്കിയ അപ്ഡേറ്റ് നടപടിക്രമം
pl_pl: Wzmocniona procedura aktualizacji

# HardenedUpdateProcedureSettingsCard.ToolTipService.ToolTip
source: When this option is enabled, the temporary private key of the on-device generated certificate will be linked to the user's account, requiring confirmation of prompts before it can be used for signing.
ar: عند تمكين هذا الخيار، سيتم ربط المفتاح الخاص المؤقت للشهادة المُنشأة على الجهاز بحساب المستخدم، مما يتطلب تأكيد المطالبات قبل أن يتمكن من استخدامه للتوقيع.
de_de: Wenn diese Option aktiviert ist, wird der temporäre private Schlüssel des geräteintern erzeugten Zertifikats mit dem Benutzerkonto verknüpft; bevor er zum Signieren verwendet werden kann, ist die Bestätigung von Eingabeaufforderungen erforderlich.
el_gr: Όταν αυτή η επιλογή είναι ενεργοποιημένη, το προσωρινό ιδιωτικό κλειδί του πιστοποιητικού που δημιουργήθηκε στη συσκευή θα συνδεθεί με τον λογαριασμό του χρήστη, απαιτώντας επιβεβαίωση των προτροπών πριν μπορέσει να χρησιμοποιηθεί για υπογραφή.
es: Cuando esta opción está habilitada, la clave privada temporal del certificado generado en el dispositivo se vinculará a la cuenta de usuario, requiriendo confirmación de avisos antes de que pueda usarse para firmar.
fr_fr: Lorsque cette option est activée, la clé privée temporaire du certificat généré sur l'appareil sera liée au compte de l'utilisateur, nécessitant la confirmation des invites avant de pouvoir être utilisée pour la signature.
he_il: כאשר אפשרות זו מופעלת, המפתח הפרטי הזמני של האישור שנוצר במכשיר יקושר לחשבון המשתמש, ותידרש אישור של בקשות לפני שניתן יהיה להשתמש בו לחתימה.
hi_in: जब यह विकल्प सक्षम है, तो डिवाइस पर उत्पन्न प्रमाणपत्र की अस्थायी निजी कुंजी उपयोगकर्ता खाते से बंधी होगी, जिससे हस्ताक्षर के लिए उपयोग करने से पहले प्रॉम्प्ट की पुष्टि की आवश्यकता होगी।
ml_in: ഈ ഓപ്ഷൻ പ്രാപ്തമാക്കുമ്പോൾ, ഉപകരണത്തിൽ സൃഷ്ടിക്കപ്പെട്ട സർട്ടിഫിക്കറ്റിന്റെ താൽക്കാലിക സ്വകാര്യ കീ ഉപയോക്തൃ അക്കൗണ്ടുമായി ബന്ധിപ്പിക്കും, ഒപ്പുവയ്ക്കാൻ ഉപയോഗിക്കുന്നതിന് മുമ്പ് പ്രോംപ്റ്റുകളുടെ സ്ഥിരീകരണം ആവശ്യപ്പെടും.
pl_pl: Gdy ta opcja jest włączona, tymczasowy klucz prywatny certyfikatu utworzonego na urządzeniu będzie powiązany z kontem użytkownika, wymagając potwierdzenia monitów przed użyciem do podpisywania.

# HardenedUpdateProcedureSettingsCard.AutomationProperties.HelpText
source: When this option is enabled, the temporary private key of the on-device generated certificate will be linked to the user's account, requiring confirmation of prompts before it can be used for signing.
ar: عند تمكين هذا الخيار، سيتم ربط المفتاح الخاص المؤقت للشهادة المُنشأة على الجهاز بحساب المستخدم، مما يتطلب تأكيد المطالبات قبل أن يتمكن من استخدامه للتوقيع.
de_de: Wenn diese Option aktiviert ist, wird der temporäre private Schlüssel des geräteintern erzeugten Zertifikats mit dem Benutzerkonto verknüpft; bevor er zum Signieren verwendet werden kann, ist die Bestätigung von Eingabeaufforderungen erforderlich.
el_gr: Όταν αυτή η επιλογή είναι ενεργοποιημένη, το προσωρινό ιδιωτικό κλειδί του πιστοποιητικού που δημιουργήθηκε στη συσκευή θα συνδεθεί με τον λογαριασμό του χρήστη, απαιτώντας επιβεβαίωση των προτροπών πριν μπορέσει να χρησιμοποιηθεί για υπογραφή.
es: Cuando esta opción está habilitada, la clave privada temporal del certificado generado en el dispositivo se vinculará a la cuenta de usuario, requiriendo confirmación de avisos antes de que pueda usarse para firmar.
fr_fr: Lorsque cette option est activée, la clé privée temporaire du certificat généré sur l'appareil sera liée au compte de l'utilisateur, nécessitant la confirmation des invites avant de pouvoir être utilisée pour la signature.
he_il: כאשר אפשרות זו מופעלת, המפתח הפרטי הזמני של האישור שנוצר במכשיר יקושר לחשבון המשתמש, ותידרש אישור של בקשות לפני שניתן יהיה להשתמש בו לחתימה.
hi_in: जब यह विकल्प सक्षम है, तो डिवाइस पर उत्पन्न प्रमाणपत्र की अस्थायी निजी कुंजी उपयोगकर्ता खाते से बंधी होगी, जिससे हस्ताक्षर के लिए उपयोग करने से पहले प्रॉम्प्ट की पुष्टि की आवश्यकता होगी।
ml_in: ഈ ഓപ്ഷൻ പ്രാപ്തമാക്കുമ്പോൾ, ഉപകരണത്തിൽ സൃഷ്ടിക്കപ്പെട്ട സർട്ടിഫിക്കറ്റിന്റെ താൽക്കാലിക സ്വകാര്യ കീ ഉപയോക്തൃ അക്കൗണ്ടുമായി ബന്ധിപ്പിക്കും, ഒപ്പുവയ്ക്കാൻ ഉപയോഗിക്കുന്നതിന് മുമ്പ് പ്രോംപ്റ്റുകളുടെ സ്ഥിരീകരണം ആവശ്യപ്പെടും.
pl_pl: Gdy ta opcja jest włączona, tymczasowy klucz prywatny certyfikatu utworzonego na urządzeniu będzie powiązany z kontem użytkownika, wymagając potwierdzenia monitów przed użyciem do podpisywania.

# RateAndReviewSettingsCard.AutomationProperties.HelpText
source: Opens the Microsoft Store mini page where you can rate and optionally write a review for the Harden System Security.
ar: يفتح صفحة Microsoft Store المصغرة حيث يمكنك تقييم وكتابة مراجعة اختيارياً لـ Harden System Security.
de_de: Öffnet die Mini-Seite des Microsoft Store, auf der Sie Harden System Security bewerten und optional eine Rezension schreiben können.
el_gr: Ανοίγει τη μίνι σελίδα Microsoft Store όπου μπορείτε να βαθμολογήσετε και προαιρετικά να γράψετε μια κριτική για το Harden System Security.
es: Abre la mini página de Microsoft Store donde puede calificar y opcionalmente escribir una reseña para Harden System Security.
fr_fr: Ouvre la mini-page du Microsoft Store où vous pouvez noter et éventuellement rédiger un avis pour Harden System Security.
he_il: פותח דף מיניאטורי ב-Microsoft Store שבו ניתן לדרג ולבחור לכתוב סקירה עבור Harden System Security.
hi_in: Microsoft Store मिनी पेज खोलता है जहाँ आप Harden System Security को रेट कर सकते हैं और वैकल्पिक रूप से समीक्षा लिख सकते हैं।
ml_in: Microsoft Store മിനി പേജ് തുറക്കുന്നു, അവിടെ നിങ്ങൾക്ക് Harden System Security റേറ്റ് ചെയ്യാനും ഐച്ഛികമായി ഒരു റിവ്യൂ എഴുതാനും കഴിയും.
pl_pl: Otwiera mini stronę Microsoft Store, gdzie możesz ocenić Harden System Security i opcjonalnie napisać recenzję.

# RateAndReviewSettingsCard.Header
source: Rate and Review
ar: تقييم ومراجعة
de_de: Bewerten und rezensieren
el_gr: Βαθμολογία και κριτική
es: Calificar y reseñar
fr_fr: Noter et commenter
he_il: דירוג וביקורת
hi_in: रेट करें और समीक्षा करें
ml_in: റേറ്റ് ചെയ്ത് റിവ്യൂ ചെയ്യുക
pl_pl: Oceń i zrecenzuj

# RateAndReviewSettingsCard.Description
source: Opens the Microsoft Store mini page where you can rate and optionally write a review for the Harden System Security.
ar: يفتح صفحة Microsoft Store المصغرة حيث يمكنك تقييم وكتابة مراجعة اختيارياً لـ Harden System Security.
de_de: Öffnet die Mini-Seite des Microsoft Store, auf der Sie Harden System Security bewerten und optional eine Rezension schreiben können.
el_gr: Ανοίγει τη μίνι σελίδα Microsoft Store όπου μπορείτε να βαθμολογήσετε και προαιρετικά να γράψετε μια κριτική για το Harden System Security.
es: Abre la mini página de Microsoft Store donde puede calificar y opcionalmente escribir una reseña para Harden System Security.
fr_fr: Ouvre la mini-page du Microsoft Store où vous pouvez noter et éventuellement rédiger un avis pour Harden System Security.
he_il: פותח דף מיניאטורי ב-Microsoft Store שבו ניתן לדרג ולבחור לכתוב סקירה עבור Harden System Security.
hi_in: Microsoft Store मिनी पेज खोलता है जहाँ आप Harden System Security को रेट कर सकते हैं और वैकल्पिक रूप से समीक्षा लिख सकते हैं।
ml_in: Microsoft Store മിനി പേജ് തുറക്കുന്നു, അവിടെ നിങ്ങൾക്ക് Harden System Security റേറ്റ് ചെയ്യാനും ഐച്ഛികമായി ഒരു റിവ്യൂ എഴുതാനും കഴിയും.
pl_pl: Otwiera mini stronę Microsoft Store, gdzie możesz ocenić Harden System Security i opcjonalnie napisać recenzję.
